In [1]:
# Initialize Otter
import otter
grader = otter.Notebook("25100072_1.ipynb")

# **Assignment 1 (Part 1)**

<h3>Assignment Instructions</h3>

* **How to install 'otter'**: Run `pip install otter-grader` in your Anaconda Command Prompt
* **Otter**: It is an autograder that we will be using for grading your notebooks.
* **Initialize Otter**: Run the cell above to initialize otter. Replace `2XXXXXX_1.ipynb` with your updated filename inside the grader variable above. 
* **grader.check('qn')**: This command runs test cases for nth question `qn` provided to you and displays the result. But these are not the only test cases, these are provided just for your basic testing. There will be some *hidden test cases* on which your answers will be tested as well.
* You are **not** allowed to edit any pre-defined variables and as per the instructions for every question you have to assign your answers to these variables.
* Write your answers in place of `...`

<h3>Submission Instructions</h3>

* There are two parts of this assignment. You should name both notebooks as **YourRollNumber_PartNumber.ipynb**. (e.g. this part should be named as *`2XXXXXXX_1.ipynb`*)
* You must submit a zip file containg just two notebooks and it must not has any folder or any other file. 
* The name of the zip file must be your `RollNumber_PA1`

Please run the cell below to import all the necessary libraries that you would require for this part

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

<h3>Context about the dataset</h3>


The titanic dataset is a record of passengers aboard the Titanic and their fates (whether or not they survived the incident). This includes socio-economic class divide between passengers, their ages, names, fares and even their passenger IDs. The principal source for data about Titanic passengers is the Encyclopedia Titanica. The datasets used here were begun by a variety of researchers. One of the original sources is Eaton & Haas (1994) Titanic: Triumph and Tragedy, Patrick Stephens Ltd, which includes a passenger list created by many researchers and edited by Michael A. Findlay.

As we explore this data from titanic, it is your job to answer some pressing questions regarding the various age groups aboard, their economic statuses and survival rates in each gender. Following are some details about the variable to help you understand the data better. <br>

<h4>Variable Descriptions</h4>

* Pclass ->   Passenger Class  (1 = 1st; 2 = 2nd; 3 = 3rd) <br>
* Survived ->  Did the passenger survive? (0 = No; 1 = Yes) <br>
* Name ->  name <br>
* Sex ->  sex  <br>
* Age ->  age  <br>
* SibSp ->  Number of Siblings/Spouses Aboard <br>
* Parch ->  Number of Parents/Children Aboard <br>
* Ticket ->   Ticket Number <br>
* Fare ->   Passenger Fare (British pound) <br>
* Cabin ->   Cabin <br>
* Embarked ->   Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton) <br>

**Question 0:** Load the titanic dataset file into the variable `titanic_df`

In [3]:
titanic_df = pd.read_csv('titanic.csv')

In [4]:
grader.check("Q0")

Q0 results: All test cases passed!

In [5]:
titanic_df

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title,Family_Size
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171,Mr,1
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599,Mrs,1
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282,Miss,0
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1,113803,Mrs,1
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450,Mr,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,27.0,NaN,S,13.0000,"Montvila, Rev. Juozas",0,887,2,male,0,0,211536,Rev,0
887,19.0,B42,S,30.0000,"Graham, Miss. Margaret Edith",0,888,1,female,0,1,112053,Miss,0
888,22.0,NaN,S,23.4500,"Johnston, Miss. Catherine Helen ""Carrie""",2,889,3,female,1,0,W./C. 6607,Miss,3
889,26.0,C148,C,30.0000,"Behr, Mr. Karl Howell",0,890,1,male,0,1,111369,Mr,0
890,32.0,NaN,Q,7.7500,"Dooley, Mr. Patrick",0,891,3,male,0,0,370376,Mr,0

**Question 1:** Using the describe function, find the mean fare  and store it into `mean_fare`, rounded off to three decimal places. You cannot directly call the .mean() function.

In [6]:
describe = titanic_df.describe()
print(describe)

              Age        Fare       Parch  PassengerId      Pclass  \
count  891.000000  891.000000  891.000000   891.000000  891.000000
mean    29.445196   32.204208    0.381594   446.000000    2.308642
std     13.244896   49.693429    0.806057   257.353842    0.836071
min      0.420000    0.000000    0.000000     1.000000    1.000000
25%     22.000000    7.910400    0.000000   223.500000    2.000000
50%     30.000000   14.454200    0.000000   446.000000    3.000000
75%     35.500000   31.000000    0.000000   668.500000    3.000000
max     80.000000  512.329200    6.000000   891.000000    3.000000

            SibSp    Survived  Family_Size
count  891.000000  891.000000   891.000000
mean     0.523008    0.383838     0.904602
std      1.102743    0.486592     1.613459
min      0.000000    0.000000     0.000000
25%      0.000000    0.000000     0.000000
50%      0.000000    0.000000     0.000000
75%      1.000000    1.000000     1.000000
max      8.000000    1.000000    10.000000

In [7]:

mean_fare = titanic_df["Fare"].describe()['mean']
mean_fare = mean_fare.round(3)



print(f'\nMean Fare is: {mean_fare}')

Mean Fare is: 32.204

In [8]:
grader.check("Q1")

Q1 results: All test cases passed!

**Question 2:** Drop the `Cabin` and `Family_Size` column inside the dataframe. `titanic_df` should no longer contain these columns.

In [9]:
titanic_df = titanic_df.drop(['Cabin', 'Family_Size'], axis=1)

In [10]:
grader.check("Q2")

Q2 results: All test cases passed!

In [11]:
titanic_df

,Age,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket,Title
0,22.0,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0,A/5 21171,Mr
1,38.0,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1,PC 17599,Mrs
2,26.0,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1,STON/O2. 3101282,Miss
3,35.0,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1,113803,Mrs
4,35.0,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0,373450,Mr
...,...,...,...,...,...,...,...,...,...,...,...,...
886,27.0,S,13.0000,"Montvila, Rev. Juozas",0,887,2,male,0,0,211536,Rev
887,19.0,S,30.0000,"Graham, Miss. Margaret Edith",0,888,1,female,0,1,112053,Miss
888,22.0,S,23.4500,"Johnston, Miss. Catherine Helen ""Carrie""",2,889,3,female,1,0,W./C. 6607,Miss
889,26.0,C,30.0000,"Behr, Mr. Karl Howell",0,890,1,male,0,1,111369,Mr
890,32.0,Q,7.7500,"Dooley, Mr. Patrick",0,891,3,male,0,0,370376,Mr

**Question 3:** What percentage of people aboard the ship were females? Store the result rounded off to three decimal places in `female_percentage`.

In [12]:
total_passengers = len(titanic_df)
female_count = titanic_df['Sex'].value_counts()['female']

female_percentage = round((female_count / total_passengers) * 100, 3)

In [13]:
grader.check("Q3")

Q3 results: All test cases passed!

**Question 4:** Set the `PassengerID` of passengers as the index for this dataset.

In [14]:
titanic_df.columns

Index([' Age', 'Embarked', 'Fare', 'Name', 'Parch', 'PassengerId', 'Pclass',
       'Sex', 'SibSp', 'Survived', 'Ticket', 'Title'],
      dtype='object')

In [15]:
titanic_df = titanic_df.set_index('PassengerId', drop= True)

In [16]:
titanic_df.head(5)

,Age,Embarked,Fare,Name,Parch,Pclass,Sex,SibSp,Survived,Ticket,Title
PassengerId,,,,,,,,,,,
1,22.0,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171,Mr
2,38.0,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599,Mrs
3,26.0,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1,STON/O2. 3101282,Miss
4,35.0,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1,113803,Mrs
5,35.0,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0,373450,Mr

In [17]:
grader.check("Q4")

Q4 results: All test cases passed!

**Question 5:** Convert all column names to lowercase and remove any leading and trailing whitespaces. Simultaneously, replace any non-leading and non-trailing spaces within the column names with an underscore. You are not allowed to hardcode the column names.

In [18]:
titanic_df.columns = titanic_df.columns.str.lower().str.strip()

In [19]:
titanic_df.columns

Index(['age', 'embarked', 'fare', 'name', 'parch', 'pclass', 'sex', 'sibsp',
       'survived', 'ticket', 'title'],
      dtype='object')

In [20]:
grader.check("Q5")

Q5 results: All test cases passed!

**Question 6:** Find the female passenger that had the highest fare and store the result in `highest_fare`. Furthermore, find the male passenger that had the lowest non-zero fare and store it in `lowest_fare`. <br>
Note: You are not meant to store the value only but the entire row entry.

In [21]:
titanic_df.columns

Index(['age', 'embarked', 'fare', 'name', 'parch', 'pclass', 'sex', 'sibsp',
       'survived', 'ticket', 'title'],
      dtype='object')

In [22]:
#  female passenger with the highest fare
highest_fare = titanic_df[titanic_df['sex'] == 'female'].loc[[titanic_df[titanic_df['sex'] == 'female']['fare'].idxmax()]]

# male passenger with the lowest non-zero fare
lowest_fare = titanic_df[(titanic_df['sex'] == 'male') & (titanic_df['fare'] > 0)].loc[[titanic_df[(titanic_df['sex'] == 'male') & (titanic_df['fare'] > 0)]['fare'].idxmin()]]

# Print
print(highest_fare)
print(lowest_fare)

              age embarked      fare              name  parch  pclass     sex  \
PassengerId
259          35.0        C  512.3292  Ward, Miss. Anna      0       1  female

             sibsp  survived    ticket title
PassengerId
259              0         1  PC 17755  Miss
              age embarked    fare                 name  parch  pclass   sex  \
PassengerId
379          20.0        C  4.0125  Betros, Mr. Tannous      0       3  male

             sibsp  survived ticket title
PassengerId
379              0         0   2648    Mr

In [23]:
grader.check("Q6")

Q6 results: All test cases passed!

**Question 7:** Write a function `CalculateSurvival(data)` that takes in a dataframe and returns the survival percentage rounded off to three decimal places.

In [24]:
def CalculateSurvivalRate(data):
    survivors = data['survived'].sum()
    count = data['survived'].count()
    survival_percentage = (survivors / count) * 100
    
    return round(survival_percentage,3)

In [25]:
grader.check("Q7")

Q7 results: All test cases passed!

**Question 8A:** Add a column called `family` to the dataframe that shows true for a passenger whose family members (siblings, spouses, parents, or children) were on board and false otherwise.

In [26]:
unique_strings = titanic_df['sibsp'].unique()

# Display the unique strings
print(unique_strings)

[1 0 3 4 2 5 8]

In [27]:
titanic_df.head(8)

,age,embarked,fare,name,parch,pclass,sex,sibsp,survived,ticket,title
PassengerId,,,,,,,,,,,
1,22.0,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171,Mr
2,38.0,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599,Mrs
3,26.0,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1,STON/O2. 3101282,Miss
4,35.0,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1,113803,Mrs
5,35.0,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0,373450,Mr
6,30.0,Q,8.4583,"Moran, Mr. James",0,3,male,0,0,330877,Mr
7,54.0,S,51.8625,"McCarthy, Mr. Timothy J",0,1,male,0,0,17463,Mr
8,2.0,S,21.0750,"Palsson, Master. Gosta Leonard",1,3,male,3,0,349909,Master

In [28]:
titanic_df['family'] = (titanic_df['sibsp'] > 0) | (titanic_df['parch'] > 0)

In [29]:
titanic_df.head()

,age,embarked,fare,name,parch,pclass,sex,sibsp,survived,ticket,title,family
PassengerId,,,,,,,,,,,,
1,22.0,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171,Mr,True
2,38.0,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599,Mrs,True
3,26.0,S,7.9250,"Heikkinen, Miss. Laina",0,3,female,0,1,STON/O2. 3101282,Miss,False
4,35.0,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,1,female,1,1,113803,Mrs,True
5,35.0,S,8.0500,"Allen, Mr. William Henry",0,3,male,0,0,373450,Mr,False

In [30]:
titanic_df['family'].value_counts()[True]

354

In [31]:
grader.check("Q8A")

Q8A results: All test cases passed!

**Question 8B:** Using the `CalculateSurvivalRate` function, find the survival percentage of the passengers who had family on board (siblings, spouses, children or parents) and store the result in `survival_rate_with_family`.

In [32]:
# Filter  passengers with family on board
family_passengers = titanic_df[titanic_df['family']]

# Calculate the total number of family passengers
total_family_passengers = len(family_passengers)

# Calculate the number of survivors among family passengers
survivors_with_family = family_passengers['survived'].sum()

# Calculate the survival rate as a percentage
if total_family_passengers > 0: 
    survival_rate_with_family = (survivors_with_family / total_family_passengers) * 100
else:
    survival_rate_with_family = 0  

# Round off
survival_rate_with_family = round(survival_rate_with_family, 3)


print(survival_rate_with_family)

50.565

In [33]:
grader.check("Q8B")

Q8B results: All test cases passed!

**Question 8C:** Using the `CalculateSurvivalRate` function, find the survival percentage of the passengers who did not have any family on board (no siblings, spouses, children and parents) and store the result in `survival_rate_without_family`.

In [34]:
# Filter passengers without family on board
no_family_passengers = titanic_df[titanic_df['family'] == False]

# Calculate the total number of no family 
total_no_family_passengers = len(no_family_passengers)

# Calculate the number of survivors among no family 
survivors_without_family = no_family_passengers['survived'].sum()

# Calculate the survival rate as a percentage
if total_no_family_passengers > 0:  # Avoid division by zero
    survival_rate_without_family = (survivors_without_family / total_no_family_passengers) * 100
else:
    survival_rate_without_family = 0  # If there are no no family passengers

# Round off
survival_rate_without_family = round(survival_rate_without_family, 3)


print(survival_rate_without_family)

30.354

In [35]:
grader.check("Q8C")

Q8C results: All test cases passed!

**Question 8D:** Based on your findings above, were the passengers who had family more likely to survive than those who did not? Answer as 'Yes' or 'No' and store it in `ans`.

In [36]:
ans = 'Yes'

In [37]:
grader.check("Q8D")

Q8D results: All test cases passed!

**Question 9:** Use `groupby` to find the survival percentage of males and females and store them in `male_survival_percentage` and `female_survival_percentage` respectively. Round off your answers to three decimal places. Not using `groupby` will result in a zero for this question.

In [38]:
survival_rates = titanic_df.groupby('sex')['survived'].mean() * 100

In [39]:
male_survival_percentage = round(survival_rates['male'],3)
female_surival_percentage = round(survival_rates['female'],3)

In [40]:
grader.check("Q9")

Q9 results: All test cases passed!

**Question 10:** Using the pandas iloc function, extract the rows with passengers aged between 5 to 20 and fare above 20. Store this result in `ilocresult`.

In [41]:
ilocresult = titanic_df[(titanic_df['age'] >= 5) & (titanic_df['age'] < 20) & (titanic_df['fare'] > 20)]
ilocresult = ilocresult[['age','fare']]

In [42]:
ilocresult.shape

(53, 2)

In [43]:
grader.check("Q10")

Q10 results: All test cases passed!

**Question 11A:** Replace the integer values in the `Pclass` columns with corresponding string data types. For example, replace 1 with 'Upper', 2 with 'Middle' and 3 with 'Lower'.

In [44]:
titanic_df['pclass'] = titanic_df['pclass'].replace({1: 'Upper', 2: 'Middle', 3: 'Lower'})

In [45]:
grader.check("Q11A")

Q11A results: All test cases passed!

**Question 11B:** Using a pivot table, represent the male and female passengers that survived in each of the three passenger classes. Store the result in `class_count`.

In [46]:
class_count = titanic_df.pivot_table(
    index='pclass',          # 
    columns='sex',          #  gender as the columns
    values='survived',      # Use the 'Survived' column for aggregation
    aggfunc='sum'           # Aggregate by summing the survived values (1 for survived, 0 for not)
)

In [47]:
class_count

sex     female  male
pclass
Lower       72    47
Middle      70    17
Upper       91    45

In [48]:
grader.check("Q11B")

Q11B results: All test cases passed!

**Well done on completing the first part of your assignment. Take a break and move onto the next!**